Barfell/STM32L151_SPI_SD_MSC/stm32/mmc_stm32f1_spi - 副本20220101.c
	for (Timer1 = 10; Timer1; ) ;	/* 10ms */
}


/* Exchange a byte */
static BYTE xchg_spi (
	BYTE dat	/* Data to send */
)
{
//	SPIx_DR = dat;				/* Start an SPI transaction */
//	while ((SPIx_SR & 0x83) != 0x03) ;	/* Wait for end of the transaction */
//	return (BYTE)SPIx_DR;		/* Return received byte */
	BYTE rxdat;
	//while(!__HAL_SPI_GET_FLAG(&hspi1, SPI_FLAG_TXE));
	while (HAL_SPI_GetState(&hspi1) != HAL_SPI_STATE_READY);
	HAL_SPI_TransmitReceive(&hspi1, &dat, &rxdat, sizeof (BYTE), SDTIMEOUT);
	return (BYTE) rxdat;
}


/* Receive multiple byte */
static void rcvr_spi_multi (
	BYTE *buff,		/* Pointer to data buffer */
	UINT btr		/* Number of bytes to receive (even number) */
)
{
//	WORD d;


//	SPIx_CR1 &= ~_BV(6);
//	SPIx_CR1 |= (_BV(6) | _BV(11));	/* Put SPI into 16-bit mode */

//	SPIx_DR = 0xFFFF;		/* Start the first SPI transaction */
//	btr -= 2;
//	do {					/* Receive the data block into buffer */
//		while ((SPIx_SR & 0x83) != 0x03) ;	/* Wait for end of the SPI transaction */
//		d = SPIx_DR;						/* Get received word */
//		SPIx_DR = 0xFFFF;					/* Start next transaction */
//		buff[1] = d; buff[0] = d >> 8; 		/* Store received data */
//		buff += 2;
//	} while (btr -= 2);
//	while ((SPIx_SR & 0x83) != 0x03) ;		/* Wait for end of the SPI transaction */
//	d = SPIx_DR;							/* Get last word received */
//	buff[1] = d; buff[0] = d >> 8;			/* Store it */

//	SPIx_CR1 &= ~(_BV(6) | _BV(11));	/* Put SPI into 8-bit mode */
//	SPIx_CR1 |= _BV(6);
	//while(!__HAL_SPI_GET_FLAG(&hspi1, SPI_FLAG_TXE));
	while ((HAL_SPI_GetState(&hspi1) != HAL_SPI_STATE_READY));
	HAL_SPI_Receive(&hspi1, buff, btr, SDTIMEOUT);
}


#if FF_FS_READONLY == 0
/* Send multiple byte */
static void xmit_spi_multi (
	const BYTE *buff,	/* Pointer to the data */
	UINT btx			/* Number of bytes to send (even number) */
)
{
//	WORD d;


//	SPIx_CR1 &= ~_BV(6);
//	SPIx_CR1 |= (_BV(6) | _BV(11));		/* Put SPI into 16-bit mode */

//	d = buff[0] << 8 | buff[1]; buff += 2;
//	SPIx_DR = d;	/* Send the first word */
//	btx -= 2;
//	do {
//		d = buff[0] << 8 | buff[1]; buff += 2;	/* Word to send next */
//		while ((SPIx_SR & 0x83) != 0x03) ;	/* Wait for end of the SPI transaction */
//		SPIx_DR;							/* Discard received word */
//		SPIx_DR = d;						/* Start next transaction */
//	} while (btx -= 2);
//	while ((SPIx_SR & 0x83) != 0x03) ;	/* Wait for end of the SPI transaction */
//	SPIx_DR;							/* Discard received word */

//	SPIx_CR1 &= ~(_BV(6) | _BV(11));	/* Put SPI into 8-bit mode */
//	SPIx_CR1 |= _BV(6);
	//while(!__HAL_SPI_GET_FLAG(&hspi1, SPI_FLAG_TXE));
	while (HAL_SPI_GetState(&hspi1) != HAL_SPI_STATE_READY);
	HAL_SPI_Transmit(&hspi1, (uint8_t*)buff, btx, SDTIMEOUT);
}
#endif


/*-----------------------------------------------------------------------*/
/* Wait for card ready                                                   */
/*-----------------------------------------------------------------------*/

static int wait_ready (	/* 1:Ready, 0:Timeout */
	UINT wt			/* Timeout [ms] */
)
{
	BYTE d;


	Timer2 = wt;
	do {
		d = xchg_spi(0xFF);
		/* This loop takes a time. Insert rot_rdq() here for multitask envilonment. */
	} while (d != 0xFF && Timer2);	/* Wait for card goes ready or timeout */

	return (d == 0xFF) ? 1 : 0;
}



/*-----------------------------------------------------------------------*/
/* Deselect card and release SPI                                         */
/*-----------------------------------------------------------------------*/

static void deselect (void)
{
	CS_HIGH();		/* Set CS# high */
	//HAL_Delay(1);++
	wait_ready(1);
	xchg_spi(0xFF);	/* Dummy clock (force DO hi-z for multiple slave SPI) */

}



/*-----------------------------------------------------------------------*/
/* Select card and wait for ready                                        */
/*-----------------------------------------------------------------------*/

static int select (void)	/* 1:OK, 0:Timeout */
{
	CS_LOW();		/* Set CS# low */
	//HAL_Delay(1);//++
	wait_ready(1);
	xchg_spi(0xFF);	/* Dummy clock (force DO enabled) */
	if (wait_ready(500)) return 1;	/* Wait for card ready */

	deselect();
	return 0;	/* Timeout */
}



/*-----------------------------------------------------------------------*/
/* Receive a data packet from the MMC                                    */
/*-----------------------------------------------------------------------*/

static int rcvr_datablock (	/* 1:OK, 0:Error */
	BYTE *buff,				/* Data buffer */
	UINT btr				/* Data block length (byte) */
)
{
	BYTE token;


	Timer1 = 200;
	do {							/* Wait for DataStart token in timeout of 200ms */
		token = xchg_spi(0xFF);
		/* This loop will take a time. Insert rot_rdq() here for multitask envilonment. */
	} while ((token == 0xFF) && Timer1);
	if(token != 0xFE) return 0;		/* Function fails if invalid DataStart token or timeout */

	rcvr_spi_multi(buff, btr);		/* Store trailing data to the buffer */
	xchg_spi(0xFF); xchg_spi(0xFF);			/* Discard CRC */

	return 1;						/* Function succeeded */
}



/*-----------------------------------------------------------------------*/
/* Send a data packet to the MMC                                         */
/*-----------------------------------------------------------------------*/

#if FF_FS_READONLY == 0
static int xmit_datablock (	/* 1:OK, 0:Failed */
	const BYTE *buff,		/* Ponter to 512 byte data to be sent */
	BYTE token				/* Token */
)
{
	BYTE resp;


	if (!wait_ready(500)) return 0;		/* Wait for card ready */

	xchg_spi(token);					/* Send token */
	if (token != 0xFD) {				/* Send data if token is other than StopTran */
		xmit_spi_multi(buff, 512);		/* Data */
		xchg_spi(0xFF); xchg_spi(0xFF);	/* Dummy CRC */

		resp = xchg_spi(0xFF);				/* Receive data resp */
		if ((resp & 0x1F) != 0x05) return 0;	/* Function fails if the data packet was not accepted */
	}
	return 1;
}
#endif


/*-----------------------------------------------------------------------*/
/* Send a command packet to the MMC                                      */
/*-----------------------------------------------------------------------*/

static BYTE send_cmd (	/* Return value: R1 resp (bit7==1:Failed to send) */
	BYTE cmd,			/* Command index */
	DWORD arg			/* Argument */
)
{
	BYTE n, res;


	if (cmd & 0x80) {	/* Send a CMD55 prior to ACMD<n> */
		cmd &= 0x7F;
		res = send_cmd(CMD55, 0);
		if (res > 1) return res;
	}

	/* Select the card and wait for ready except to stop multiple block read */
	if (cmd != CMD12) {
		deselect();
		if (!select()) return 0xFF;
	}

	/* Send command packet */
	xchg_spi(0x40 | cmd);				/* Start + command index */
	xchg_spi((BYTE)(arg >> 24));		/* Argument[31..24] */
	xchg_spi((BYTE)(arg >> 16));		/* Argument[23..16] */
	xchg_spi((BYTE)(arg >> 8));			/* Argument[15..8] */
	xchg_spi((BYTE)arg);				/* Argument[7..0] */
	n = 0x01;							/* Dummy CRC + Stop */
	if (cmd == CMD0) n = 0x95;			/* Valid CRC for CMD0(0) */
	if (cmd == CMD8) n = 0x87;			/* Valid CRC for CMD8(0x1AA) */
	xchg_spi(n);

